import Utils from '../../src/utils/Utils';

describe('Utils 기능 테스트', () => {
  test.each([
    ['3', 0],
    ['11', 1],
    ['19', 2],
    ['27', 3],
    ['21', 4],
    ['15', 5],
    ['9', 6],
  ])('날짜에 대응되는 요일 계산', (visitDate, day) => {
    expect(Utils.calculateVisitDay(visitDate)).toBe(day);
  });

  test('입력받은 메뉴에서 주문 메뉴와 개수 분리', () => {
    expect(
      Utils.separateMenu(
        '양송이수프-1,바비큐립-2,초코케이크-3,시저샐러드-1,제로콜라-10,샴페인-1',
      ),
    ).toEqual([
      ['양송이수프', '1'],
      ['바비큐립', '2'],
      ['초코케이크', '3'],
      ['시저샐러드', '1'],
      ['제로콜라', '10'],
      ['샴페인', '1'],
    ]);
  });

  test.each([
    [999, '999'],
    [1000, '1,000'],
    [1234567, '1,234,567'],
    [-9876543, '-9,876,543'],
    ['1,234,567', '1,234,567'],
    ['', ''],
    [10_000_000, '10,000,000'],
  ])("금액을 천 단위로 ',(쉼표)'를 붙임", (amount, answer) => {
    expect(Utils.separateThousand(amount)).toBe(answer);
  });
});
